config/my-general-config.org
#+TITLE: General configuration
#+PROPERTY: header-args+ :comments both
#+PROPERTY: header-args+ :mkdirp yes
#+PROPERTY: header-args+ :tangle "my-general-config.el"
#+SETUPFILE: ./_setup.org

These are my settings that are called in =dotspacemacs/user-config=. This function is called at the very end of Spacemacs initialization after layers configuration.

* General
Hitting TAB always just indents the current line.

#+BEGIN_SRC emacs-lisp
(setq tab-always-indent t)
#+END_SRC

Only one auth source for magit & co.

#+BEGIN_SRC emacs-lisp
(setq auth-sources '("~/.netrc"))
#+END_SRC

Utf-8

#+BEGIN_SRC emacs-lisp
(prefer-coding-system 'utf-8)
#+END_SRC

Enable line wrapping

#+BEGIN_SRC emacs-lisp
(setq truncate-lines nil)
#+END_SRC

Enable [[https://github.com/dacap/keyfreq][key frequency]] tracking

#+BEGIN_SRC emacs-lisp
(setq truncate-lines nil)
(keyfreq-mode 1)
(keyfreq-autosave-mode 1)
(setq keyfreq-excluded-commands
      '(self-insert-command))
#+END_SRC
* Appearance
Clean up spaceline contents.

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'spaceline-segments
  (spaceline-toggle-minor-modes-off)
  (spaceline-toggle-buffer-size-off))
#+END_SRC

* Major Mode Settings
** Magit
Add ioki-github.com to browsable URLs, therefore also create [[https://github.com/rmuslimov/browse-at-remote/blob/cef26f2c063f2473af42d0e126c8613fe2f709e4/browse-at-remote.el#L254-L264][custom formatters, based on the normal github formatter]].

#+begin_src emacs-lisp
(with-eval-after-load 'browse-at-remote

  (add-to-list 'browse-at-remote-remote-type-regexps '("^ioki-github\\.com$" . "ioki-github"))

  (defun browse-at-remote--format-region-url-as-ioki-github (repo-url location filename &optional linestart lineend)
    "URL formatted for github."
    (setq repo-url (s-replace "ioki-github" "github" repo-url))

    (cond
     ((and linestart lineend)
      (format "%s/blob/%s/%s#L%d-L%d" repo-url location filename linestart lineend))
     (linestart (format "%s/blob/%s/%s#L%d" repo-url location filename linestart))
     (t (format "%s/tree/%s/%s" repo-url location filename))))

  (defun browse-at-remote--format-commit-url-as-ioki-github (repo-url commithash)
    "Commit URL formatted for github"
    (setq repo-url (s-replace "ioki-github" "github" repo-url))
    (format "%s/commit/%s" repo-url commithash))

  )
#+end_src

Enable private Gitlab instance in magit forge

#+begin_src emacs-lisp
(with-eval-after-load 'forge
  (add-to-list 'forge-alist '("gitlab.io.ki" "gitlab.io.ki/api/v4" "gitlab.io.ki" forge-gitlab-repository))
)
#+end_src

** LSP
Disable documentation overlays, use =, h h= instead.

#+begin_src emacs-lisp
(setq lsp-ui-doc-enable nil)
#+end_src

Disable file watches, as many folders will slow Emacs down.
#+begin_src emacs-lisp
(setq lsp-enable-file-watchers nil)
#+end_src
