config/my-general-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-09 Wed 15:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>General configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christian Bäuerlein" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">General configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf5c9cd">1. General</a></li>
<li><a href="#org96f3178">2. Appearance</a></li>
<li><a href="#org5966e5d">3. Major Mode Settings</a>
<ul>
<li><a href="#orgb0a38f4">3.1. Magit</a></li>
<li><a href="#org7137277">3.2. LSP</a></li>
<li><a href="#org84f331c">3.3. Ruby</a></li>
<li><a href="#org26e2e43">3.4. Elixir</a></li>
<li><a href="#org7166f50">3.5. Go</a></li>
<li><a href="#orgec487d7">3.6. Web Mode</a></li>
<li><a href="#orgd631dbc">3.7. JavaScript</a></li>
<li><a href="#org481ab2d">3.8. TypeScript</a></li>
<li><a href="#org8bb4797">3.9. SQL</a></li>
</ul>
</li>
<li><a href="#orge8d2c64">4. Keybindings</a>
<ul>
<li><a href="#orgcef4e7c">4.1. Movements</a></li>
<li><a href="#orgde8935d">4.2. Macros</a></li>
<li><a href="#orgabc87fa">4.3. Dired</a></li>
<li><a href="#org14d283f">4.4. Umlauts</a></li>
<li><a href="#orga397311">4.5. Misc</a></li>
</ul>
</li>
<li><a href="#orge3cd58d">5. Emojis</a></li>
<li><a href="#orgf21f15d">6. Custom Functions</a>
<ul>
<li><a href="#orgc5c7f86">6.1. Switch between Rails i18n files</a></li>
<li><a href="#org7e45426">6.2. Exercism</a></li>
</ul>
</li>
<li><a href="#orgb60e721">7. Finalization</a></li>
</ul>
</div>
</div>
<p>
These are my settings that are called in <code>dotspacemacs/user-config</code>. This function is called at the very end of Spacemacs initialization after layers configuration.
</p>

<div id="outline-container-orgaf5c9cd" class="outline-2">
<h2 id="orgaf5c9cd"><span class="section-number-2">1.</span> General</h2>
<div class="outline-text-2" id="text-1">
<p>
Setting the default directory to my user home.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> default-directory <span class="org-string">"~/"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Hitting TAB always just indents the current line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> tab-always-indent t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Only one auth source for magit &amp; co.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> auth-sources '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"~/.netrc"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Utf-8
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>prefer-coding-system 'utf-8<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Enable line wrapping
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> truncate-lines nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Enable <a href="https://github.com/dacap/keyfreq">key frequency</a> tracking
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> truncate-lines nil<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>keyfreq-mode <span class="org-highlight-numbers-number">1</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>keyfreq-autosave-mode <span class="org-highlight-numbers-number">1</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> keyfreq-excluded-commands
      '<span class="org-rainbow-delimiters-depth-2">(</span>self-insert-command<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org96f3178" class="outline-2">
<h2 id="org96f3178"><span class="section-number-2">2.</span> Appearance</h2>
<div class="outline-text-2" id="text-2">
<p>
Clean up spaceline contents.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'spaceline-segments
  <span class="org-rainbow-delimiters-depth-2">(</span>spaceline-toggle-minor-modes-off<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>spaceline-toggle-buffer-size-off<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5966e5d" class="outline-2">
<h2 id="org5966e5d"><span class="section-number-2">3.</span> Major Mode Settings</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb0a38f4" class="outline-3">
<h3 id="orgb0a38f4"><span class="section-number-3">3.1.</span> Magit</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Add ioki-github.com to browsable URLs, therefore also create <a href="https://github.com/rmuslimov/browse-at-remote/blob/cef26f2c063f2473af42d0e126c8613fe2f709e4/browse-at-remote.el#L254-L264">custom formatters, based on the normal github formatter</a>.
</p>

<p>
This allows to visit links via SPC g o
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'browse-at-remote

  <span class="org-rainbow-delimiters-depth-2">(</span>add-to-list 'browse-at-remote-remote-type-regexps '<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"^ioki-github\\.com$"</span> . <span class="org-string">"ioki-github"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">browse-at-remote--format-region-url-as-ioki-github</span> <span class="org-rainbow-delimiters-depth-3">(</span>repo-url location filename <span class="org-type">&amp;optional</span> linestart lineend<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-doc">"URL formatted for github."</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq</span> repo-url <span class="org-rainbow-delimiters-depth-4">(</span>s-replace <span class="org-string">"ioki-github"</span> <span class="org-string">"github"</span> repo-url<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>

    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">cond</span>
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">and</span> linestart lineend<span class="org-rainbow-delimiters-depth-5">)</span>
      <span class="org-rainbow-delimiters-depth-5">(</span>format <span class="org-string">"%s/blob/%s/%s#L%d-L%d"</span> repo-url location filename linestart lineend<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     <span class="org-rainbow-delimiters-depth-4">(</span>linestart <span class="org-rainbow-delimiters-depth-5">(</span>format <span class="org-string">"%s/blob/%s/%s#L%d"</span> repo-url location filename linestart<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     <span class="org-rainbow-delimiters-depth-4">(</span>t <span class="org-rainbow-delimiters-depth-5">(</span>format <span class="org-string">"%s/tree/%s/%s"</span> repo-url location filename<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">browse-at-remote--format-commit-url-as-ioki-github</span> <span class="org-rainbow-delimiters-depth-3">(</span>repo-url commithash<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-doc">"Commit URL formatted for github"</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq</span> repo-url <span class="org-rainbow-delimiters-depth-4">(</span>s-replace <span class="org-string">"ioki-github"</span> <span class="org-string">"github"</span> repo-url<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>format <span class="org-string">"%s/commit/%s"</span> repo-url commithash<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Enable private Gitlab instance in magit forge
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'forge
  <span class="org-rainbow-delimiters-depth-2">(</span>add-to-list 'forge-alist '<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"gitlab.io.ki"</span> <span class="org-string">"gitlab.io.ki/api/v4"</span> <span class="org-string">"gitlab.io.ki"</span> forge-gitlab-repository<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'browse-at-remote
  <span class="org-rainbow-delimiters-depth-2">(</span>add-to-list 'browse-at-remote-remote-type-regexps '<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"^gitlab\\.io\\.ki$"</span> . <span class="org-string">"gitlab"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7137277" class="outline-3">
<h3 id="org7137277"><span class="section-number-3">3.2.</span> LSP</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Disable documentation overlays, use <code>, h h</code> instead.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> lsp-ui-doc-enable nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Disable file watches, as many folders will slow Emacs down.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> lsp-enable-file-watchers nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
