config/my-general-config.org
** Ruby
Don't automatically insert the magic encoding comment.

#+BEGIN_SRC emacs-lisp
(setq ruby-insert-encoding-magic-comment nil)
#+END_SRC

Keybinding to toggle between new and old hash syntax.

#+BEGIN_SRC emacs-lisp
(evil-leader/set-key
  "xrh" 'ruby-toggle-hash-syntax)
#+END_SRC

Underscore should be a word delimiter in slim.

#+BEGIN_SRC emacs-lisp
(add-hook 'slim-mode-hook #'(lambda () (modify-syntax-entry ?_ "_")))
#+END_SRC
** Elixir
Call elixir-format before save.

#+BEGIN_SRC emacs-lisp
(add-hook 'elixir-mode-hook
          (lambda () (add-hook 'before-save-hook 'elixir-format nil t)))
#+END_SRC

Keybindings for [[https://github.com/ananthakumaran/exunit.el][Emacs ExUnit test runner]].

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'elixir-mode
  (spacemacs/declare-prefix-for-mode 'elixir-mode
    "mt" "tests" "testing related functionality")
  (spacemacs/set-leader-keys-for-major-mode 'elixir-mode
    "ta" 'exunit-verify-all
    "tb" 'exunit-verify
    "tr" 'exunit-rerun
    "tt" 'exunit-verify-single))
#+END_SRC

[[https://elixirforum.com/t/emacs-elixir-setup-configuration-wiki/19196][Pin the exunit window to the bottom]].

#+BEGIN_SRC emacs-lisp
(push '("*exunit-compilation*"
        :dedicated t
        :position bottom
        :stick t
        :height 0.4
        :noselect t)
      popwin:special-display-config)
#+END_SRC
** Go
Set tab width to 4.

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
(setq-default go-tab-width 4)
#+END_SRC

Call go-format before save.

#+BEGIN_SRC emacs-lisp
(setq go-format-before-save t)
#+END_SRC

Enable flycheck for Go mode.

#+BEGIN_SRC emacs-lisp
(add-hook 'go-mode-hook
          (lambda () (flycheck-mode 1)))
#+END_SRC
** Web Mode
Intendation settings

#+BEGIN_SRC emacs-lisp
(setq web-mode-css-indent-offset 2)
(setq js2-basic-offset 2)
(setq web-mode-markup-indent-offset 2)
(setq web-mode-code-indent-offset 2)
(setq css-indent-offset 2)
(setq-default js2-basic-offset 2
              js-indent-level 2)

#+END_SRC
** JavaScript
Allow =.dir-locals.el= files to set prettier-related settings.

#+BEGIN_SRC emacs-lisp
(put 'prettier-js-args 'safe-local-variable 'listp)
(put 'prettier-js-command 'safe-local-variable 'stringp)
#+END_SRC

Setup [[https://github.com/abicky/nodejs-repl.el][nodejs-repl.el]] keybindings.
#+BEGIN_SRC emacs-lisp
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "ne" 'nodejs-repl-send-last-expression)
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "nl" 'nodejs-repl-send-line)
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "nr" 'nodejs-repl-send-region)
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "nb" 'nodejs-repl-send-buffer)
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "nf" 'nodejs-repl-load-file)
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "n'" 'nodejs-repl-switch-to-repl)
(spacemacs/set-leader-keys-for-major-mode 'js2-mode "ns" 'nodejs-repl-switch-to-repl)
#+END_SRC
** TypeScript
Set [[https://github.com/emacs-typescript/typescript.el/blob/master/typescript-mode.el#L635-L640][indentation level]] to two spaces.

#+begin_src emacs-lisp
(setq typescript-indent-level 2)
#+end_src
** SQL
The =sqlfmt= does not work very well with Postgres and is also outdated.
This uses [[https://github.com/darold/pgFormatter][pgFormatter]] instead, installed with =brew install pgformatter=.

#+BEGIN_SRC emacs-lisp
(setq sqlfmt-executable "pg_format")
(setq sqlfmt-options '())
#+END_SRC
* Keybindings
