config/my-general-config.html
<div id="outline-container-org84f331c" class="outline-3">
<h3 id="org84f331c"><span class="section-number-3">3.3.</span> Ruby</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Don't automatically insert the magic encoding comment.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> ruby-insert-encoding-magic-comment nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Keybinding to toggle between new and old hash syntax.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>evil-leader/set-key
  <span class="org-string">"xrh"</span> 'ruby-toggle-hash-syntax<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Underscore should be a word delimiter in slim.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'slim-mode-hook #'<span class="org-rainbow-delimiters-depth-2">(</span>lambda <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span>modify-syntax-entry ?_ <span class="org-string">"_"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org26e2e43" class="outline-3">
<h3 id="org26e2e43"><span class="section-number-3">3.4.</span> Elixir</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Call elixir-format before save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'elixir-mode-hook
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span>add-hook 'before-save-hook 'elixir-format nil t<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Keybindings for <a href="https://github.com/ananthakumaran/exunit.el">Emacs ExUnit test runner</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'elixir-mode
  <span class="org-rainbow-delimiters-depth-2">(</span>spacemacs/declare-prefix-for-mode 'elixir-mode
    <span class="org-string">"mt"</span> <span class="org-string">"tests"</span> <span class="org-string">"testing related functionality"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>spacemacs/set-leader-keys-for-major-mode 'elixir-mode
    <span class="org-string">"ta"</span> 'exunit-verify-all
    <span class="org-string">"tb"</span> 'exunit-verify
    <span class="org-string">"tr"</span> 'exunit-rerun
    <span class="org-string">"tt"</span> 'exunit-verify-single<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<a href="https://elixirforum.com/t/emacs-elixir-setup-configuration-wiki/19196">Pin the exunit window to the bottom</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">push</span> '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"*exunit-compilation*"</span>
        <span class="org-builtin">:dedicated</span> t
        <span class="org-builtin">:position</span> bottom
        <span class="org-builtin">:stick</span> t
        <span class="org-builtin">:height</span> <span class="org-highlight-numbers-number">0.4</span>
        <span class="org-builtin">:noselect</span> t<span class="org-rainbow-delimiters-depth-2">)</span>
      popwin:special-display-config<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7166f50" class="outline-3">
<h3 id="org7166f50"><span class="section-number-3">3.5.</span> Go</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Set tab width to 4.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> tab-width <span class="org-highlight-numbers-number">4</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> go-tab-width <span class="org-highlight-numbers-number">4</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Call go-format before save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> go-format-before-save t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Enable flycheck for Go mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'go-mode-hook
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span>flycheck-mode <span class="org-highlight-numbers-number">1</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec487d7" class="outline-3">
<h3 id="orgec487d7"><span class="section-number-3">3.6.</span> Web Mode</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Intendation settings
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> web-mode-css-indent-offset <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> js2-basic-offset <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> web-mode-markup-indent-offset <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> web-mode-code-indent-offset <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> css-indent-offset <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> js2-basic-offset <span class="org-highlight-numbers-number">2</span>
              js-indent-level <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgd631dbc" class="outline-3">
<h3 id="orgd631dbc"><span class="section-number-3">3.7.</span> JavaScript</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Allow <code>.dir-locals.el</code> files to set prettier-related settings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>put 'prettier-js-args 'safe-local-variable 'listp<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>put 'prettier-js-command 'safe-local-variable 'stringp<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Setup <a href="https://github.com/abicky/nodejs-repl.el">nodejs-repl.el</a> keybindings.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"ne"</span> 'nodejs-repl-send-last-expression<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"nl"</span> 'nodejs-repl-send-line<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"nr"</span> 'nodejs-repl-send-region<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"nb"</span> 'nodejs-repl-send-buffer<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"nf"</span> 'nodejs-repl-load-file<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"n'"</span> 'nodejs-repl-switch-to-repl<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs/set-leader-keys-for-major-mode 'js2-mode <span class="org-string">"ns"</span> 'nodejs-repl-switch-to-repl<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org481ab2d" class="outline-3">
<h3 id="org481ab2d"><span class="section-number-3">3.8.</span> TypeScript</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Set <a href="https://github.com/emacs-typescript/typescript.el/blob/master/typescript-mode.el#L635-L640">indentation level</a> to two spaces.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> typescript-indent-level <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bb4797" class="outline-3">
<h3 id="org8bb4797"><span class="section-number-3">3.9.</span> SQL</h3>
<div class="outline-text-3" id="text-3-9">
<p>
The <code>sqlfmt</code> does not work very well with Postgres and is also outdated.
This uses <a href="https://github.com/darold/pgFormatter">pgFormatter</a> instead, installed with <code>brew install pgformatter</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> sqlfmt-executable <span class="org-string">"pg_format"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> sqlfmt-options '<span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
