config/my-general-config.org
** Movements
Make evil-mode up/down operate in screen lines instead of logical lines.

#+BEGIN_SRC emacs-lisp
(define-key evil-motion-state-map "j" 'evil-next-visual-line)
(define-key evil-motion-state-map "k" 'evil-previous-visual-line)
#+END_SRC

Also in visual mode...

#+BEGIN_SRC emacs-lisp
(define-key evil-visual-state-map "j" 'evil-next-visual-line)
(define-key evil-visual-state-map "k" 'evil-previous-visual-line)
#+END_SRC

Move line under cursor with =C-j/k=.

#+BEGIN_SRC emacs-lisp
(define-key evil-normal-state-map (kbd "C-j") 'drag-stuff-down)
(define-key evil-normal-state-map (kbd "C-k") 'drag-stuff-up)
#+END_SRC

Pressing =H= in any edit mode moves the cursor to the first non-blank character.

#+BEGIN_SRC emacs-lisp
(evil-global-set-key 'normal "H" 'evil-first-non-blank)
(evil-global-set-key 'visual "H" 'evil-first-non-blank)
(evil-global-set-key 'motion "H" 'evil-first-non-blank)
#+END_SRC

Pressing =L= in any edit mode moves the cursor to the end of line.

#+BEGIN_SRC emacs-lisp
(evil-global-set-key 'normal "L" (lambda () (interactive) (evil-end-of-line)))
(evil-global-set-key 'visual "L" (lambda () (interactive) (evil-end-of-line)))
(evil-global-set-key 'motion "L" (lambda () (interactive) (evil-end-of-line)))
#+END_SRC

Type =g l= to get a fast home row friendly jump menu to go to a visible line.

#+BEGIN_SRC emacs-lisp
(define-key evil-motion-state-map "gl" 'evil-avy-goto-line)
(define-key evil-normal-state-map "gl" 'evil-avy-goto-line)
#+END_SRC

Type =g o <char> <char>= to get a fast home row friendly jump menu to go to a visible word that starts with these characters.

#+BEGIN_SRC emacs-lisp
(define-key evil-motion-state-map "go" 'evil-avy-goto-char-2)
(define-key evil-normal-state-map "go" 'evil-avy-goto-char-2)
#+END_SRC
** Macros

Type =Q= to execute the macro recorded to =q.=

#+BEGIN_SRC emacs-lisp
(evil-global-set-key 'normal (kbd "Q") (lambda () (interactive) (evil-execute-macro 1 "@q")))
#+END_SRC
** Dired
In =dired=, move to parent directory with =h= and open thing under cursor with =l=.

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'dired
  (evil-define-key 'normal dired-mode-map
    "h" 'dired-up-directory
    "l" 'dired-find-file
    )
  )
#+END_SRC
