config/my-general-config.html
<div id="outline-container-orge8d2c64" class="outline-2">
<h2 id="orge8d2c64"><span class="section-number-2">4.</span> Keybindings</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcef4e7c" class="outline-3">
<h3 id="orgcef4e7c"><span class="section-number-3">4.1.</span> Movements</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Make evil-mode up/down operate in screen lines instead of logical lines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-motion-state-map <span class="org-string">"j"</span> 'evil-next-visual-line<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-motion-state-map <span class="org-string">"k"</span> 'evil-previous-visual-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Also in visual mode&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-visual-state-map <span class="org-string">"j"</span> 'evil-next-visual-line<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-visual-state-map <span class="org-string">"k"</span> 'evil-previous-visual-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Move line under cursor with <code>C-j/k</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-normal-state-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-j"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'drag-stuff-down<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-normal-state-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-k"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'drag-stuff-up<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Pressing <code>H</code> in any edit mode moves the cursor to the first non-blank character.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'normal <span class="org-string">"H"</span> 'evil-first-non-blank<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'visual <span class="org-string">"H"</span> 'evil-first-non-blank<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'motion <span class="org-string">"H"</span> 'evil-first-non-blank<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Pressing <code>L</code> in any edit mode moves the cursor to the end of line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'normal <span class="org-string">"L"</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>evil-end-of-line<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'visual <span class="org-string">"L"</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>evil-end-of-line<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'motion <span class="org-string">"L"</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>evil-end-of-line<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Type <code>g l</code> to get a fast home row friendly jump menu to go to a visible line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-motion-state-map <span class="org-string">"gl"</span> 'evil-avy-goto-line<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-normal-state-map <span class="org-string">"gl"</span> 'evil-avy-goto-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Type <code>g o &lt;char&gt; &lt;char&gt;</code> to get a fast home row friendly jump menu to go to a visible word that starts with these characters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-motion-state-map <span class="org-string">"go"</span> 'evil-avy-goto-char-2<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key evil-normal-state-map <span class="org-string">"go"</span> 'evil-avy-goto-char-2<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde8935d" class="outline-3">
<h3 id="orgde8935d"><span class="section-number-3">4.2.</span> Macros</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Type <code>Q</code> to execute the macro recorded to <code>q.</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>evil-global-set-key 'normal <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"Q"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>evil-execute-macro <span class="org-highlight-numbers-number">1</span> <span class="org-string">"@q"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgabc87fa" class="outline-3">
<h3 id="orgabc87fa"><span class="section-number-3">4.3.</span> Dired</h3>
<div class="outline-text-3" id="text-4-3">
<p>
In <code>dired</code>, move to parent directory with <code>h</code> and open thing under cursor with <code>l</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'dired
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">evil-define-key</span> 'normal dired-mode-map
    <span class="org-string">"h"</span> 'dired-up-directory
    <span class="org-string">"l"</span> 'dired-find-file
    <span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
