config/my-general-config.html
<div id="outline-container-org14d283f" class="outline-3">
<h3 id="org14d283f"><span class="section-number-3">4.4.</span> Umlauts</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Make Umlauts work like in the rest of MacOS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>global-unset-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-s"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-s"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#223;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#223;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-unset-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u a"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#228;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#228;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u A"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#196;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#196;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u o"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#246;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#246;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u O"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#214;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#214;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u u"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#252;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#252;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-u U"</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
                  <span class="org-doc">"Insert &#220;."</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-3">)</span>
                  <span class="org-rainbow-delimiters-depth-3">(</span>insert <span class="org-string">"&#220;"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga397311" class="outline-3">
<h3 id="orga397311"><span class="section-number-3">4.5.</span> Misc</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Set hippie expand from M-/ to ctrl-space.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-SPC"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'hippie-expand<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge3cd58d" class="outline-2">
<h2 id="orge3cd58d"><span class="section-number-2">5.</span> Emojis</h2>
<div class="outline-text-2" id="text-5">
<p>
Overwrite emoji settings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">--set-emoji-font</span> <span class="org-rainbow-delimiters-depth-2">(</span>frame<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Adjust the font settings of FRAME so Emacs can display emoji properly."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>eq system-type 'darwin<span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">For NS/Cocoa</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>set-fontset-font t 'symbol <span class="org-rainbow-delimiters-depth-4">(</span>font-spec <span class="org-builtin">:family</span> <span class="org-string">"Apple Color Emoji"</span> <span class="org-builtin">:size</span> <span class="org-highlight-numbers-number">10</span><span class="org-rainbow-delimiters-depth-4">)</span> frame 'prepend<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">For Linux</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>set-fontset-font t 'symbol <span class="org-rainbow-delimiters-depth-4">(</span>font-spec <span class="org-builtin">:family</span> <span class="org-string">"Symbola"</span><span class="org-rainbow-delimiters-depth-4">)</span> frame 'prepend<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">For when Emacs is started in GUI mode:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>--set-emoji-font nil<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Hook for when a frame is created with emacsclient</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'after-make-frame-functions '--set-emoji-font<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> company-emoji-insert-unicode t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf21f15d" class="outline-2">
<h2 id="orgf21f15d"><span class="section-number-2">6.</span> Custom Functions</h2>
<div class="outline-text-2" id="text-6">
<p>
Helper functions that I call directly with <code>SPC SPC</code>.
</p>
</div>
<div id="outline-container-orgc5c7f86" class="outline-3">
<h3 id="orgc5c7f86"><span class="section-number-3">6.1.</span> Switch between Rails i18n files</h3>
<div class="outline-text-3" id="text-6-1">
<p>
This function switches between the German and the English translation file in a Rails project. Especially handy, if the project has a lot of files per language.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">switch-rails-i18n-file</span><span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Switches to the i18n file in the other language"</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>search <span class="org-string">"/de/"</span> buffer-file-name<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>find-file <span class="org-rainbow-delimiters-depth-4">(</span>replace-regexp-in-string <span class="org-string">"/de/"</span> <span class="org-string">"/en/"</span> <span class="org-rainbow-delimiters-depth-5">(</span>buffer-file-name<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>find-file <span class="org-rainbow-delimiters-depth-4">(</span>replace-regexp-in-string <span class="org-string">"/en/"</span> <span class="org-string">"/de/"</span> <span class="org-rainbow-delimiters-depth-5">(</span>buffer-file-name<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
